src/InformationRegisters/ЖИПК_ПараметрыРеглЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖИПК_ПараметрыРеглЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖИПК_РеглЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖИПК_ПараметрыРеглЗаданий/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл

		Задание = РегламентныеЗаданияСервер.Задание(Запись.Идентификатор);
		
		Если Задание = Неопределено Тогда 
				
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", 	Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", 	Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", 	"(ЖИПК) " + Строка(Запись.РегламентноеЗадание) );
			ПараметрыЗадания.Вставить("Ключ", 			Запись.Идентификатор);
			ПараметрыЗадания.Вставить("Расписание", 	Запись.Расписание.Получить() );
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() );
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", 		МассивПараметров);
			
			Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			
			Запись.Идентификатор = Задание.УникальныйИдентификатор;
			
		Иначе
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", 	Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", 	Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", 	"(ЖИПК) " + Строка(Запись.РегламентноеЗадание) );
			ПараметрыЗадания.Вставить("Ключ", 			Запись.Идентификатор);
			ПараметрыЗадания.Вставить("Расписание", 	Запись.Расписание.Получить() );
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() );
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", 		МассивПараметров);
		
			РегламентныеЗаданияСервер.ИзменитьЗадание(Запись.Идентификатор, ПараметрыЗадания);  
			
		КонецЕсли;			
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
